ветку с сервера можно получить  с помощью команды gif fetch
объединить ветку можно с помощью команды git mrge surname
 (слияние) — добавление изменений одной фиксированной версии к другой;
 (клонирование) — копирует удаленную базу данных на локальный компьютер, тем самым создавая локальную базу данных;
(отправка) — отправляет версий из вашего локального репозиторий на удалённый репозиторий;
 (получение) — получает информацию о зафиксированных версиях из удаленного репозитория;
(вытягивание) — получает информацию о зафиксированных версиях и выполняет слияние текущей локальной версии и последней из полученных версий из уделнного репозитория

